h-2-45deg/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         60;

deltaT          0.01;

writeControl    timeStep;

writeInterval   1000;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

\\adjustTimeStep  yes;

\\maxCo           1;

libs ("libatmosphericModels.so");

functions
{
#includeFunc  residuals
    
	vorticity1
    {
        type            vorticity;
        libs            ("libfieldFunctionObjects.so");
        writeControl    writeTime;
    }
	
	Q1
    {
        type            Q;
        libs            ("libfieldFunctionObjects.so");
        writeControl    writeTime;
    }
	
    yPlus
    {
        type            yPlus;
        libs            ("libfieldFunctionObjects.so");
        writeControl    writeTime;
    }

    wallShearStress1
    {
        type        wallShearStress;
        libs        ("libfieldFunctionObjects.so");
        writeControl    writeTime;
        patches     ("body");
    }
    
    forces
    {
        type                forces;
        functionObjectLibs  ("libforces.so");
        writeControl       timeStep;
        writeInterval      10;
        patches             ( "body" );
        pName               p;
        UName               U;
        rho                 rhoInf;
        log                 true; 
        CofR                (3.05 3.05 0);     
        rhoInf              1.225;
    }
     
    forceCoeffs
    {
        type                forceCoeffs;
        functionObjectLibs  ( "libforces.so" );
        writeControl       timeStep;
        writeInterval       10;
        patches             ( "body" );
        pName               p;
        UName               U;
        rho                 rhoInf;
        log                 true;
         
        liftDir             (0 0 1);
        dragDir             (1 0 0);
        CofR                (3.05 3.05 0);
        pitchAxis           (0 1 0);
         
        magUInf             5;
        rhoInf              1.225;
        lRef                0.6;
        Aref                0.06;
    }

    func
    {
        type pressure;
        functionObjectLibs ("libutilityFunctionObjects.so");
        writeControl       timeStep;
        writeInterval      10;
        calcTotal no;
        pRef 0;
        calcCoeff yes;
        pInf 0;
        UInf (5 0 0);
        rhoInf 1.225;
        writeControl timeStep;
        writeInterval 1;
    }
    
    fieldAverage1
    {
        type            fieldAverage;
        libs            ("libfieldFunctionObjects.so");
        writeControl    writeTime;
      
        fields
        (
            U
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }

            p
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }
            
            static(p)_coeff
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }
            
            k
            {
                mean        on;
                prime2Mean  off;
                base        time;
            }

            omega
            {
                mean        on;
                prime2Mean  off;
                base        time;
            }
        );
    }
}

// ************************************************************************* //
